_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 21, 5500, 50)      1850      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 21, 5500, 50)      62550     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 21, 5500, 50)      62550     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 2750, 50)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 10, 2750, 75)      33825     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 1374, 75)       50700     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 6, 686, 75)        50700     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 343, 75)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 3, 172, 100)       30100     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 2, 86, 100)        40100     
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 1, 43, 100)        40100     
_________________________________________________________________
flatten_1 (Flatten)          (None, 4300)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 2500)              10752500  
_________________________________________________________________
dropout_1 (Dropout)          (None, 2500)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 750)               1875750   
_________________________________________________________________
dense_3 (Dense)              (None, 200)               150200    
_________________________________________________________________
dense_4 (Dense)              (None, 6)                 1206      
_________________________________________________________________
activation_1 (Activation)    (None, 6)                 0         
=================================================================
Total params: 13,152,131
Trainable params: 13,152,131
Non-trainable params: 0
_________________________________________________________________
